garyPenhook/PIC-Assembler/device_includes/pic16f13275.inc
// Register: CRCOUTL
#define CRCOUTL CRCOUTL
CRCOUTL                                  equ 01CA1h
// bitfield definitions
CRCOUTL_OUT_POSN                         equ 0000h
CRCOUTL_OUT_POSITION                     equ 0000h
CRCOUTL_OUT_SIZE                         equ 0008h
CRCOUTL_OUT_LENGTH                       equ 0008h
CRCOUTL_OUT_MASK                         equ 00FFh
CRCOUTL_OUT0_POSN                        equ 0000h
CRCOUTL_OUT0_POSITION                    equ 0000h
CRCOUTL_OUT0_SIZE                        equ 0001h
CRCOUTL_OUT0_LENGTH                      equ 0001h
CRCOUTL_OUT0_MASK                        equ 0001h
CRCOUTL_OUT1_POSN                        equ 0001h
CRCOUTL_OUT1_POSITION                    equ 0001h
CRCOUTL_OUT1_SIZE                        equ 0001h
CRCOUTL_OUT1_LENGTH                      equ 0001h
CRCOUTL_OUT1_MASK                        equ 0002h
CRCOUTL_OUT2_POSN                        equ 0002h
CRCOUTL_OUT2_POSITION                    equ 0002h
CRCOUTL_OUT2_SIZE                        equ 0001h
CRCOUTL_OUT2_LENGTH                      equ 0001h
CRCOUTL_OUT2_MASK                        equ 0004h
CRCOUTL_OUT3_POSN                        equ 0003h
CRCOUTL_OUT3_POSITION                    equ 0003h
CRCOUTL_OUT3_SIZE                        equ 0001h
CRCOUTL_OUT3_LENGTH                      equ 0001h
CRCOUTL_OUT3_MASK                        equ 0008h
CRCOUTL_OUT4_POSN                        equ 0004h
CRCOUTL_OUT4_POSITION                    equ 0004h
CRCOUTL_OUT4_SIZE                        equ 0001h
CRCOUTL_OUT4_LENGTH                      equ 0001h
CRCOUTL_OUT4_MASK                        equ 0010h
CRCOUTL_OUT5_POSN                        equ 0005h
CRCOUTL_OUT5_POSITION                    equ 0005h
CRCOUTL_OUT5_SIZE                        equ 0001h
CRCOUTL_OUT5_LENGTH                      equ 0001h
CRCOUTL_OUT5_MASK                        equ 0020h
CRCOUTL_OUT6_POSN                        equ 0006h
CRCOUTL_OUT6_POSITION                    equ 0006h
CRCOUTL_OUT6_SIZE                        equ 0001h
CRCOUTL_OUT6_LENGTH                      equ 0001h
CRCOUTL_OUT6_MASK                        equ 0040h
CRCOUTL_OUT7_POSN                        equ 0007h
CRCOUTL_OUT7_POSITION                    equ 0007h
CRCOUTL_OUT7_SIZE                        equ 0001h
CRCOUTL_OUT7_LENGTH                      equ 0001h
CRCOUTL_OUT7_MASK                        equ 0080h

// Register: CRCSHFTL
#define CRCSHFTL CRCSHFTL
CRCSHFTL                                 equ 01CA1h
// bitfield definitions
CRCSHFTL_SHIFT_POSN                      equ 0000h
CRCSHFTL_SHIFT_POSITION                  equ 0000h
CRCSHFTL_SHIFT_SIZE                      equ 0008h
CRCSHFTL_SHIFT_LENGTH                    equ 0008h
CRCSHFTL_SHIFT_MASK                      equ 00FFh
CRCSHFTL_SHIFT0_POSN                     equ 0000h
CRCSHFTL_SHIFT0_POSITION                 equ 0000h
CRCSHFTL_SHIFT0_SIZE                     equ 0001h
CRCSHFTL_SHIFT0_LENGTH                   equ 0001h
CRCSHFTL_SHIFT0_MASK                     equ 0001h
CRCSHFTL_SHIFT1_POSN                     equ 0001h
CRCSHFTL_SHIFT1_POSITION                 equ 0001h
CRCSHFTL_SHIFT1_SIZE                     equ 0001h
CRCSHFTL_SHIFT1_LENGTH                   equ 0001h
CRCSHFTL_SHIFT1_MASK                     equ 0002h
CRCSHFTL_SHIFT2_POSN                     equ 0002h
CRCSHFTL_SHIFT2_POSITION                 equ 0002h
CRCSHFTL_SHIFT2_SIZE                     equ 0001h
CRCSHFTL_SHIFT2_LENGTH                   equ 0001h
CRCSHFTL_SHIFT2_MASK                     equ 0004h
CRCSHFTL_SHIFT3_POSN                     equ 0003h
CRCSHFTL_SHIFT3_POSITION                 equ 0003h
CRCSHFTL_SHIFT3_SIZE                     equ 0001h
CRCSHFTL_SHIFT3_LENGTH                   equ 0001h
CRCSHFTL_SHIFT3_MASK                     equ 0008h
CRCSHFTL_SHIFT4_POSN                     equ 0004h
CRCSHFTL_SHIFT4_POSITION                 equ 0004h
CRCSHFTL_SHIFT4_SIZE                     equ 0001h
CRCSHFTL_SHIFT4_LENGTH                   equ 0001h
CRCSHFTL_SHIFT4_MASK                     equ 0010h
CRCSHFTL_SHIFT5_POSN                     equ 0005h
CRCSHFTL_SHIFT5_POSITION                 equ 0005h
CRCSHFTL_SHIFT5_SIZE                     equ 0001h
CRCSHFTL_SHIFT5_LENGTH                   equ 0001h
CRCSHFTL_SHIFT5_MASK                     equ 0020h
CRCSHFTL_SHIFT6_POSN                     equ 0006h
CRCSHFTL_SHIFT6_POSITION                 equ 0006h
CRCSHFTL_SHIFT6_SIZE                     equ 0001h
CRCSHFTL_SHIFT6_LENGTH                   equ 0001h
CRCSHFTL_SHIFT6_MASK                     equ 0040h
CRCSHFTL_SHIFT7_POSN                     equ 0007h
CRCSHFTL_SHIFT7_POSITION                 equ 0007h
CRCSHFTL_SHIFT7_SIZE                     equ 0001h
CRCSHFTL_SHIFT7_LENGTH                   equ 0001h
CRCSHFTL_SHIFT7_MASK                     equ 0080h

// Register: CRCXORL
#define CRCXORL CRCXORL
CRCXORL                                  equ 01CA1h
// bitfield definitions
CRCXORL_XOR_POSN                         equ 0000h
CRCXORL_XOR_POSITION                     equ 0000h
CRCXORL_XOR_SIZE                         equ 0008h
CRCXORL_XOR_LENGTH                       equ 0008h
CRCXORL_XOR_MASK                         equ 00FFh
CRCXORL_XOR0_POSN                        equ 0000h
CRCXORL_XOR0_POSITION                    equ 0000h
CRCXORL_XOR0_SIZE                        equ 0001h
CRCXORL_XOR0_LENGTH                      equ 0001h
CRCXORL_XOR0_MASK                        equ 0001h
CRCXORL_XOR1_POSN                        equ 0001h
CRCXORL_XOR1_POSITION                    equ 0001h
CRCXORL_XOR1_SIZE                        equ 0001h
CRCXORL_XOR1_LENGTH                      equ 0001h
CRCXORL_XOR1_MASK                        equ 0002h
CRCXORL_XOR2_POSN                        equ 0002h
CRCXORL_XOR2_POSITION                    equ 0002h
CRCXORL_XOR2_SIZE                        equ 0001h
CRCXORL_XOR2_LENGTH                      equ 0001h
CRCXORL_XOR2_MASK                        equ 0004h
CRCXORL_XOR3_POSN                        equ 0003h
CRCXORL_XOR3_POSITION                    equ 0003h
CRCXORL_XOR3_SIZE                        equ 0001h
CRCXORL_XOR3_LENGTH                      equ 0001h
CRCXORL_XOR3_MASK                        equ 0008h
CRCXORL_XOR4_POSN                        equ 0004h
CRCXORL_XOR4_POSITION                    equ 0004h
CRCXORL_XOR4_SIZE                        equ 0001h
CRCXORL_XOR4_LENGTH                      equ 0001h
CRCXORL_XOR4_MASK                        equ 0010h
CRCXORL_XOR5_POSN                        equ 0005h
CRCXORL_XOR5_POSITION                    equ 0005h
CRCXORL_XOR5_SIZE                        equ 0001h
CRCXORL_XOR5_LENGTH                      equ 0001h
CRCXORL_XOR5_MASK                        equ 0020h
CRCXORL_XOR6_POSN                        equ 0006h
CRCXORL_XOR6_POSITION                    equ 0006h
CRCXORL_XOR6_SIZE                        equ 0001h
CRCXORL_XOR6_LENGTH                      equ 0001h
CRCXORL_XOR6_MASK                        equ 0040h
CRCXORL_XOR7_POSN                        equ 0007h
CRCXORL_XOR7_POSITION                    equ 0007h
CRCXORL_XOR7_SIZE                        equ 0001h
CRCXORL_XOR7_LENGTH                      equ 0001h
CRCXORL_XOR7_MASK                        equ 0080h

// Register: CRCOUTH
#define CRCOUTH CRCOUTH
CRCOUTH                                  equ 01CA2h
// bitfield definitions
CRCOUTH_OUT_POSN                         equ 0000h
CRCOUTH_OUT_POSITION                     equ 0000h
CRCOUTH_OUT_SIZE                         equ 0008h
CRCOUTH_OUT_LENGTH                       equ 0008h
CRCOUTH_OUT_MASK                         equ 00FFh
CRCOUTH_OUT8_POSN                        equ 0000h
CRCOUTH_OUT8_POSITION                    equ 0000h
CRCOUTH_OUT8_SIZE                        equ 0001h
CRCOUTH_OUT8_LENGTH                      equ 0001h
CRCOUTH_OUT8_MASK                        equ 0001h
CRCOUTH_OUT9_POSN                        equ 0001h
CRCOUTH_OUT9_POSITION                    equ 0001h
CRCOUTH_OUT9_SIZE                        equ 0001h
CRCOUTH_OUT9_LENGTH                      equ 0001h
CRCOUTH_OUT9_MASK                        equ 0002h
CRCOUTH_OUT10_POSN                       equ 0002h
CRCOUTH_OUT10_POSITION                   equ 0002h
CRCOUTH_OUT10_SIZE                       equ 0001h
CRCOUTH_OUT10_LENGTH                     equ 0001h
CRCOUTH_OUT10_MASK                       equ 0004h
CRCOUTH_OUT11_POSN                       equ 0003h
CRCOUTH_OUT11_POSITION                   equ 0003h
CRCOUTH_OUT11_SIZE                       equ 0001h
CRCOUTH_OUT11_LENGTH                     equ 0001h
CRCOUTH_OUT11_MASK                       equ 0008h
CRCOUTH_OUT12_POSN                       equ 0004h
CRCOUTH_OUT12_POSITION                   equ 0004h
CRCOUTH_OUT12_SIZE                       equ 0001h
CRCOUTH_OUT12_LENGTH                     equ 0001h
CRCOUTH_OUT12_MASK                       equ 0010h
CRCOUTH_OUT13_POSN                       equ 0005h
CRCOUTH_OUT13_POSITION                   equ 0005h
CRCOUTH_OUT13_SIZE                       equ 0001h
CRCOUTH_OUT13_LENGTH                     equ 0001h
CRCOUTH_OUT13_MASK                       equ 0020h
CRCOUTH_OUT14_POSN                       equ 0006h
CRCOUTH_OUT14_POSITION                   equ 0006h
CRCOUTH_OUT14_SIZE                       equ 0001h
CRCOUTH_OUT14_LENGTH                     equ 0001h
CRCOUTH_OUT14_MASK                       equ 0040h
CRCOUTH_OUT15_POSN                       equ 0007h
CRCOUTH_OUT15_POSITION                   equ 0007h
CRCOUTH_OUT15_SIZE                       equ 0001h
CRCOUTH_OUT15_LENGTH                     equ 0001h
CRCOUTH_OUT15_MASK                       equ 0080h

// Register: CRCSHFTH
#define CRCSHFTH CRCSHFTH
CRCSHFTH                                 equ 01CA2h
// bitfield definitions
CRCSHFTH_SHIFT_POSN                      equ 0000h
CRCSHFTH_SHIFT_POSITION                  equ 0000h
CRCSHFTH_SHIFT_SIZE                      equ 0008h
CRCSHFTH_SHIFT_LENGTH                    equ 0008h
CRCSHFTH_SHIFT_MASK                      equ 00FFh
CRCSHFTH_SHIFT8_POSN                     equ 0000h
CRCSHFTH_SHIFT8_POSITION                 equ 0000h
CRCSHFTH_SHIFT8_SIZE                     equ 0001h
CRCSHFTH_SHIFT8_LENGTH                   equ 0001h
CRCSHFTH_SHIFT8_MASK                     equ 0001h
CRCSHFTH_SHIFT9_POSN                     equ 0001h
CRCSHFTH_SHIFT9_POSITION                 equ 0001h
CRCSHFTH_SHIFT9_SIZE                     equ 0001h
CRCSHFTH_SHIFT9_LENGTH                   equ 0001h
CRCSHFTH_SHIFT9_MASK                     equ 0002h
CRCSHFTH_SHIFT10_POSN                    equ 0002h
CRCSHFTH_SHIFT10_POSITION                equ 0002h
CRCSHFTH_SHIFT10_SIZE                    equ 0001h
CRCSHFTH_SHIFT10_LENGTH                  equ 0001h
CRCSHFTH_SHIFT10_MASK                    equ 0004h
CRCSHFTH_SHIFT11_POSN                    equ 0003h
CRCSHFTH_SHIFT11_POSITION                equ 0003h
CRCSHFTH_SHIFT11_SIZE                    equ 0001h
CRCSHFTH_SHIFT11_LENGTH                  equ 0001h
CRCSHFTH_SHIFT11_MASK                    equ 0008h
CRCSHFTH_SHIFT12_POSN                    equ 0004h
CRCSHFTH_SHIFT12_POSITION                equ 0004h
CRCSHFTH_SHIFT12_SIZE                    equ 0001h
CRCSHFTH_SHIFT12_LENGTH                  equ 0001h
CRCSHFTH_SHIFT12_MASK                    equ 0010h
CRCSHFTH_SHIFT13_POSN                    equ 0005h
CRCSHFTH_SHIFT13_POSITION                equ 0005h
CRCSHFTH_SHIFT13_SIZE                    equ 0001h
CRCSHFTH_SHIFT13_LENGTH                  equ 0001h
CRCSHFTH_SHIFT13_MASK                    equ 0020h
CRCSHFTH_SHIFT14_POSN                    equ 0006h
CRCSHFTH_SHIFT14_POSITION                equ 0006h
CRCSHFTH_SHIFT14_SIZE                    equ 0001h
CRCSHFTH_SHIFT14_LENGTH                  equ 0001h
CRCSHFTH_SHIFT14_MASK                    equ 0040h
CRCSHFTH_SHIFT15_POSN                    equ 0007h
CRCSHFTH_SHIFT15_POSITION                equ 0007h
CRCSHFTH_SHIFT15_SIZE                    equ 0001h
CRCSHFTH_SHIFT15_LENGTH                  equ 0001h
CRCSHFTH_SHIFT15_MASK                    equ 0080h

// Register: CRCXORH
#define CRCXORH CRCXORH
CRCXORH                                  equ 01CA2h
// bitfield definitions
CRCXORH_XOR_POSN                         equ 0000h
CRCXORH_XOR_POSITION                     equ 0000h
CRCXORH_XOR_SIZE                         equ 0008h
CRCXORH_XOR_LENGTH                       equ 0008h
CRCXORH_XOR_MASK                         equ 00FFh
CRCXORH_XOR8_POSN                        equ 0000h
CRCXORH_XOR8_POSITION                    equ 0000h
CRCXORH_XOR8_SIZE                        equ 0001h
CRCXORH_XOR8_LENGTH                      equ 0001h
CRCXORH_XOR8_MASK                        equ 0001h
CRCXORH_XOR9_POSN                        equ 0001h
CRCXORH_XOR9_POSITION                    equ 0001h
CRCXORH_XOR9_SIZE                        equ 0001h
CRCXORH_XOR9_LENGTH                      equ 0001h
CRCXORH_XOR9_MASK                        equ 0002h
CRCXORH_XOR10_POSN                       equ 0002h
CRCXORH_XOR10_POSITION                   equ 0002h
CRCXORH_XOR10_SIZE                       equ 0001h
CRCXORH_XOR10_LENGTH                     equ 0001h
CRCXORH_XOR10_MASK                       equ 0004h
CRCXORH_XOR11_POSN                       equ 0003h
CRCXORH_XOR11_POSITION                   equ 0003h
CRCXORH_XOR11_SIZE                       equ 0001h
CRCXORH_XOR11_LENGTH                     equ 0001h
CRCXORH_XOR11_MASK                       equ 0008h
CRCXORH_XOR12_POSN                       equ 0004h
CRCXORH_XOR12_POSITION                   equ 0004h
CRCXORH_XOR12_SIZE                       equ 0001h
CRCXORH_XOR12_LENGTH                     equ 0001h
CRCXORH_XOR12_MASK                       equ 0010h
CRCXORH_XOR13_POSN                       equ 0005h
CRCXORH_XOR13_POSITION                   equ 0005h
CRCXORH_XOR13_SIZE                       equ 0001h
CRCXORH_XOR13_LENGTH                     equ 0001h
CRCXORH_XOR13_MASK                       equ 0020h
CRCXORH_XOR14_POSN                       equ 0006h
CRCXORH_XOR14_POSITION                   equ 0006h
CRCXORH_XOR14_SIZE                       equ 0001h
CRCXORH_XOR14_LENGTH                     equ 0001h
CRCXORH_XOR14_MASK                       equ 0040h
CRCXORH_XOR15_POSN                       equ 0007h
CRCXORH_XOR15_POSITION                   equ 0007h
CRCXORH_XOR15_SIZE                       equ 0001h
CRCXORH_XOR15_LENGTH                     equ 0001h
CRCXORH_XOR15_MASK                       equ 0080h

