garyPenhook/PIC-Assembler/device_includes/pic16f13275.inc
// Register: ADCG1B
#define ADCG1B ADCG1B
ADCG1B                                   equ 01D2Fh
// bitfield definitions
ADCG1B_CGB0_POSN                         equ 0000h
ADCG1B_CGB0_POSITION                     equ 0000h
ADCG1B_CGB0_SIZE                         equ 0001h
ADCG1B_CGB0_LENGTH                       equ 0001h
ADCG1B_CGB0_MASK                         equ 0001h
ADCG1B_CGB1_POSN                         equ 0001h
ADCG1B_CGB1_POSITION                     equ 0001h
ADCG1B_CGB1_SIZE                         equ 0001h
ADCG1B_CGB1_LENGTH                       equ 0001h
ADCG1B_CGB1_MASK                         equ 0002h
ADCG1B_CGB2_POSN                         equ 0002h
ADCG1B_CGB2_POSITION                     equ 0002h
ADCG1B_CGB2_SIZE                         equ 0001h
ADCG1B_CGB2_LENGTH                       equ 0001h
ADCG1B_CGB2_MASK                         equ 0004h
ADCG1B_CGB3_POSN                         equ 0003h
ADCG1B_CGB3_POSITION                     equ 0003h
ADCG1B_CGB3_SIZE                         equ 0001h
ADCG1B_CGB3_LENGTH                       equ 0001h
ADCG1B_CGB3_MASK                         equ 0008h
ADCG1B_CGB4_POSN                         equ 0004h
ADCG1B_CGB4_POSITION                     equ 0004h
ADCG1B_CGB4_SIZE                         equ 0001h
ADCG1B_CGB4_LENGTH                       equ 0001h
ADCG1B_CGB4_MASK                         equ 0010h
ADCG1B_CGB5_POSN                         equ 0005h
ADCG1B_CGB5_POSITION                     equ 0005h
ADCG1B_CGB5_SIZE                         equ 0001h
ADCG1B_CGB5_LENGTH                       equ 0001h
ADCG1B_CGB5_MASK                         equ 0020h
ADCG1B_CGB6_POSN                         equ 0006h
ADCG1B_CGB6_POSITION                     equ 0006h
ADCG1B_CGB6_SIZE                         equ 0001h
ADCG1B_CGB6_LENGTH                       equ 0001h
ADCG1B_CGB6_MASK                         equ 0040h
ADCG1B_CGB7_POSN                         equ 0007h
ADCG1B_CGB7_POSITION                     equ 0007h
ADCG1B_CGB7_SIZE                         equ 0001h
ADCG1B_CGB7_LENGTH                       equ 0001h
ADCG1B_CGB7_MASK                         equ 0080h

// Register: ADCG1C
#define ADCG1C ADCG1C
ADCG1C                                   equ 01D30h
// bitfield definitions
ADCG1C_CGC0_POSN                         equ 0000h
ADCG1C_CGC0_POSITION                     equ 0000h
ADCG1C_CGC0_SIZE                         equ 0001h
ADCG1C_CGC0_LENGTH                       equ 0001h
ADCG1C_CGC0_MASK                         equ 0001h
ADCG1C_CGC1_POSN                         equ 0001h
ADCG1C_CGC1_POSITION                     equ 0001h
ADCG1C_CGC1_SIZE                         equ 0001h
ADCG1C_CGC1_LENGTH                       equ 0001h
ADCG1C_CGC1_MASK                         equ 0002h
ADCG1C_CGC2_POSN                         equ 0002h
ADCG1C_CGC2_POSITION                     equ 0002h
ADCG1C_CGC2_SIZE                         equ 0001h
ADCG1C_CGC2_LENGTH                       equ 0001h
ADCG1C_CGC2_MASK                         equ 0004h
ADCG1C_CGC3_POSN                         equ 0003h
ADCG1C_CGC3_POSITION                     equ 0003h
ADCG1C_CGC3_SIZE                         equ 0001h
ADCG1C_CGC3_LENGTH                       equ 0001h
ADCG1C_CGC3_MASK                         equ 0008h
ADCG1C_CGC4_POSN                         equ 0004h
ADCG1C_CGC4_POSITION                     equ 0004h
ADCG1C_CGC4_SIZE                         equ 0001h
ADCG1C_CGC4_LENGTH                       equ 0001h
ADCG1C_CGC4_MASK                         equ 0010h
ADCG1C_CGC5_POSN                         equ 0005h
ADCG1C_CGC5_POSITION                     equ 0005h
ADCG1C_CGC5_SIZE                         equ 0001h
ADCG1C_CGC5_LENGTH                       equ 0001h
ADCG1C_CGC5_MASK                         equ 0020h
ADCG1C_CGC6_POSN                         equ 0006h
ADCG1C_CGC6_POSITION                     equ 0006h
ADCG1C_CGC6_SIZE                         equ 0001h
ADCG1C_CGC6_LENGTH                       equ 0001h
ADCG1C_CGC6_MASK                         equ 0040h
ADCG1C_CGC7_POSN                         equ 0007h
ADCG1C_CGC7_POSITION                     equ 0007h
ADCG1C_CGC7_SIZE                         equ 0001h
ADCG1C_CGC7_LENGTH                       equ 0001h
ADCG1C_CGC7_MASK                         equ 0080h

// Register: ADCG1D
#define ADCG1D ADCG1D
ADCG1D                                   equ 01D31h
// bitfield definitions
ADCG1D_CGD0_POSN                         equ 0000h
ADCG1D_CGD0_POSITION                     equ 0000h
ADCG1D_CGD0_SIZE                         equ 0001h
ADCG1D_CGD0_LENGTH                       equ 0001h
ADCG1D_CGD0_MASK                         equ 0001h
ADCG1D_CGD1_POSN                         equ 0001h
ADCG1D_CGD1_POSITION                     equ 0001h
ADCG1D_CGD1_SIZE                         equ 0001h
ADCG1D_CGD1_LENGTH                       equ 0001h
ADCG1D_CGD1_MASK                         equ 0002h
ADCG1D_CGD2_POSN                         equ 0002h
ADCG1D_CGD2_POSITION                     equ 0002h
ADCG1D_CGD2_SIZE                         equ 0001h
ADCG1D_CGD2_LENGTH                       equ 0001h
ADCG1D_CGD2_MASK                         equ 0004h
ADCG1D_CGD3_POSN                         equ 0003h
ADCG1D_CGD3_POSITION                     equ 0003h
ADCG1D_CGD3_SIZE                         equ 0001h
ADCG1D_CGD3_LENGTH                       equ 0001h
ADCG1D_CGD3_MASK                         equ 0008h
ADCG1D_CGD4_POSN                         equ 0004h
ADCG1D_CGD4_POSITION                     equ 0004h
ADCG1D_CGD4_SIZE                         equ 0001h
ADCG1D_CGD4_LENGTH                       equ 0001h
ADCG1D_CGD4_MASK                         equ 0010h
ADCG1D_CGD5_POSN                         equ 0005h
ADCG1D_CGD5_POSITION                     equ 0005h
ADCG1D_CGD5_SIZE                         equ 0001h
ADCG1D_CGD5_LENGTH                       equ 0001h
ADCG1D_CGD5_MASK                         equ 0020h
ADCG1D_CGD6_POSN                         equ 0006h
ADCG1D_CGD6_POSITION                     equ 0006h
ADCG1D_CGD6_SIZE                         equ 0001h
ADCG1D_CGD6_LENGTH                       equ 0001h
ADCG1D_CGD6_MASK                         equ 0040h
ADCG1D_CGD7_POSN                         equ 0007h
ADCG1D_CGD7_POSITION                     equ 0007h
ADCG1D_CGD7_SIZE                         equ 0001h
ADCG1D_CGD7_LENGTH                       equ 0001h
ADCG1D_CGD7_MASK                         equ 0080h

// Register: ADCG1E
#define ADCG1E ADCG1E
ADCG1E                                   equ 01D32h
// bitfield definitions
ADCG1E_CGE0_POSN                         equ 0000h
ADCG1E_CGE0_POSITION                     equ 0000h
ADCG1E_CGE0_SIZE                         equ 0001h
ADCG1E_CGE0_LENGTH                       equ 0001h
ADCG1E_CGE0_MASK                         equ 0001h
ADCG1E_CGE1_POSN                         equ 0001h
ADCG1E_CGE1_POSITION                     equ 0001h
ADCG1E_CGE1_SIZE                         equ 0001h
ADCG1E_CGE1_LENGTH                       equ 0001h
ADCG1E_CGE1_MASK                         equ 0002h
ADCG1E_CGE2_POSN                         equ 0002h
ADCG1E_CGE2_POSITION                     equ 0002h
ADCG1E_CGE2_SIZE                         equ 0001h
ADCG1E_CGE2_LENGTH                       equ 0001h
ADCG1E_CGE2_MASK                         equ 0004h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 01D8Ch
// bitfield definitions
RA0PPS_RA0PPS_POSN                       equ 0000h
RA0PPS_RA0PPS_POSITION                   equ 0000h
RA0PPS_RA0PPS_SIZE                       equ 0006h
RA0PPS_RA0PPS_LENGTH                     equ 0006h
RA0PPS_RA0PPS_MASK                       equ 003Fh

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 01D8Dh
// bitfield definitions
RA1PPS_RA1PPS_POSN                       equ 0000h
RA1PPS_RA1PPS_POSITION                   equ 0000h
RA1PPS_RA1PPS_SIZE                       equ 0006h
RA1PPS_RA1PPS_LENGTH                     equ 0006h
RA1PPS_RA1PPS_MASK                       equ 003Fh

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 01D8Eh
// bitfield definitions
RA2PPS_RA2PPS_POSN                       equ 0000h
RA2PPS_RA2PPS_POSITION                   equ 0000h
RA2PPS_RA2PPS_SIZE                       equ 0006h
RA2PPS_RA2PPS_LENGTH                     equ 0006h
RA2PPS_RA2PPS_MASK                       equ 003Fh

