garyPenhook/PIC-Assembler/device_includes/pic16f13275.inc
// Register: RC5PPS
#define RC5PPS RC5PPS
RC5PPS                                   equ 01DA1h
// bitfield definitions
RC5PPS_RC5PPS_POSN                       equ 0000h
RC5PPS_RC5PPS_POSITION                   equ 0000h
RC5PPS_RC5PPS_SIZE                       equ 0006h
RC5PPS_RC5PPS_LENGTH                     equ 0006h
RC5PPS_RC5PPS_MASK                       equ 003Fh

// Register: RC6PPS
#define RC6PPS RC6PPS
RC6PPS                                   equ 01DA2h
// bitfield definitions
RC6PPS_RC6PPS_POSN                       equ 0000h
RC6PPS_RC6PPS_POSITION                   equ 0000h
RC6PPS_RC6PPS_SIZE                       equ 0006h
RC6PPS_RC6PPS_LENGTH                     equ 0006h
RC6PPS_RC6PPS_MASK                       equ 003Fh

// Register: RC7PPS
#define RC7PPS RC7PPS
RC7PPS                                   equ 01DA3h
// bitfield definitions
RC7PPS_RC7PPS_POSN                       equ 0000h
RC7PPS_RC7PPS_POSITION                   equ 0000h
RC7PPS_RC7PPS_SIZE                       equ 0006h
RC7PPS_RC7PPS_LENGTH                     equ 0006h
RC7PPS_RC7PPS_MASK                       equ 003Fh

// Register: RD0PPS
#define RD0PPS RD0PPS
RD0PPS                                   equ 01DA4h
// bitfield definitions
RD0PPS_RD0PPS_POSN                       equ 0000h
RD0PPS_RD0PPS_POSITION                   equ 0000h
RD0PPS_RD0PPS_SIZE                       equ 0006h
RD0PPS_RD0PPS_LENGTH                     equ 0006h
RD0PPS_RD0PPS_MASK                       equ 003Fh

// Register: RD1PPS
#define RD1PPS RD1PPS
RD1PPS                                   equ 01DA5h
// bitfield definitions
RD1PPS_RD1PPS_POSN                       equ 0000h
RD1PPS_RD1PPS_POSITION                   equ 0000h
RD1PPS_RD1PPS_SIZE                       equ 0006h
RD1PPS_RD1PPS_LENGTH                     equ 0006h
RD1PPS_RD1PPS_MASK                       equ 003Fh

// Register: RD2PPS
#define RD2PPS RD2PPS
RD2PPS                                   equ 01DA6h
// bitfield definitions
RD2PPS_RD2PPS_POSN                       equ 0000h
RD2PPS_RD2PPS_POSITION                   equ 0000h
RD2PPS_RD2PPS_SIZE                       equ 0006h
RD2PPS_RD2PPS_LENGTH                     equ 0006h
RD2PPS_RD2PPS_MASK                       equ 003Fh

// Register: RD3PPS
#define RD3PPS RD3PPS
RD3PPS                                   equ 01DA7h
// bitfield definitions
RD3PPS_RD3PPS_POSN                       equ 0000h
RD3PPS_RD3PPS_POSITION                   equ 0000h
RD3PPS_RD3PPS_SIZE                       equ 0006h
RD3PPS_RD3PPS_LENGTH                     equ 0006h
RD3PPS_RD3PPS_MASK                       equ 003Fh

// Register: RD4PPS
#define RD4PPS RD4PPS
RD4PPS                                   equ 01DA8h
// bitfield definitions
RD4PPS_RD4PPS_POSN                       equ 0000h
RD4PPS_RD4PPS_POSITION                   equ 0000h
RD4PPS_RD4PPS_SIZE                       equ 0006h
RD4PPS_RD4PPS_LENGTH                     equ 0006h
RD4PPS_RD4PPS_MASK                       equ 003Fh

// Register: RD5PPS
#define RD5PPS RD5PPS
RD5PPS                                   equ 01DA9h
// bitfield definitions
RD5PPS_RD5PPS_POSN                       equ 0000h
RD5PPS_RD5PPS_POSITION                   equ 0000h
RD5PPS_RD5PPS_SIZE                       equ 0006h
RD5PPS_RD5PPS_LENGTH                     equ 0006h
RD5PPS_RD5PPS_MASK                       equ 003Fh

// Register: RD6PPS
#define RD6PPS RD6PPS
RD6PPS                                   equ 01DAAh
// bitfield definitions
RD6PPS_RD6PPS_POSN                       equ 0000h
RD6PPS_RD6PPS_POSITION                   equ 0000h
RD6PPS_RD6PPS_SIZE                       equ 0006h
RD6PPS_RD6PPS_LENGTH                     equ 0006h
RD6PPS_RD6PPS_MASK                       equ 003Fh

// Register: RD7PPS
#define RD7PPS RD7PPS
RD7PPS                                   equ 01DABh
// bitfield definitions
RD7PPS_RD7PPS_POSN                       equ 0000h
RD7PPS_RD7PPS_POSITION                   equ 0000h
RD7PPS_RD7PPS_SIZE                       equ 0006h
RD7PPS_RD7PPS_LENGTH                     equ 0006h
RD7PPS_RD7PPS_MASK                       equ 003Fh

// Register: RE0PPS
#define RE0PPS RE0PPS
RE0PPS                                   equ 01DACh
// bitfield definitions
RE0PPS_RE0PPS_POSN                       equ 0000h
RE0PPS_RE0PPS_POSITION                   equ 0000h
RE0PPS_RE0PPS_SIZE                       equ 0006h
RE0PPS_RE0PPS_LENGTH                     equ 0006h
RE0PPS_RE0PPS_MASK                       equ 003Fh

// Register: RE1PPS
#define RE1PPS RE1PPS
RE1PPS                                   equ 01DADh
// bitfield definitions
RE1PPS_RE1PPS_POSN                       equ 0000h
RE1PPS_RE1PPS_POSITION                   equ 0000h
RE1PPS_RE1PPS_SIZE                       equ 0006h
RE1PPS_RE1PPS_LENGTH                     equ 0006h
RE1PPS_RE1PPS_MASK                       equ 003Fh

// Register: RE2PPS
#define RE2PPS RE2PPS
RE2PPS                                   equ 01DAEh
// bitfield definitions
RE2PPS_RE2PPS_POSN                       equ 0000h
RE2PPS_RE2PPS_POSITION                   equ 0000h
RE2PPS_RE2PPS_SIZE                       equ 0006h
RE2PPS_RE2PPS_LENGTH                     equ 0006h
RE2PPS_RE2PPS_MASK                       equ 003Fh

// Register: TRISC0PPS
#define TRISC0PPS TRISC0PPS
TRISC0PPS                                equ 01DD0h
// bitfield definitions
TRISC0PPS_TRISC0PPS_POSN                 equ 0000h
TRISC0PPS_TRISC0PPS_POSITION             equ 0000h
TRISC0PPS_TRISC0PPS_SIZE                 equ 0006h
TRISC0PPS_TRISC0PPS_LENGTH               equ 0006h
TRISC0PPS_TRISC0PPS_MASK                 equ 003Fh

// Register: TRISC1PPS
#define TRISC1PPS TRISC1PPS
TRISC1PPS                                equ 01DD1h
// bitfield definitions
TRISC1PPS_TRISC1PPS_POSN                 equ 0000h
TRISC1PPS_TRISC1PPS_POSITION             equ 0000h
TRISC1PPS_TRISC1PPS_SIZE                 equ 0006h
TRISC1PPS_TRISC1PPS_LENGTH               equ 0006h
TRISC1PPS_TRISC1PPS_MASK                 equ 003Fh

